<template>
    <div id="profile2">
       <p>我是一名程序员</p>
       <p>程序员工作只能做到35岁吗之后的路是怎么走的呢?</p>
      <pre>
          想一直做计算机，但是听说稍微一上年纪就容易被淘
          汰，确实是这样的么？技术好的也是这样的?那年纪大
          点有什么路可以选择呢？</pre>
          <img src="@/assets/gaici.jpg">
         <p>有人说程序员老得快，有时候五十多岁就长着一张八十多岁的脸。</p>
         <pre>
         我二十二的时候，他们说程序员只能干到25 。
         我二十五的时候，他们说程序员只能干到27 。
         我三十的时候，他们说程序员只能干到 35 。
         我现在三十七了。我觉得再干三十年毫无压力。
         据说图灵奖得主，SQL语言发明人 Jim Gray 七十六岁还在写程序，
         上帝无法用时间打败他，最终让他消失在茫茫大海。Jim Gray (computer scientist)
         如果你仍有斗志，上天就只能让你失踪于海难，
         让你出车祸，让你死于滑翔伞事故，让你得阿兹海默氏症，
         或者诸如此类的方式，才能无耻的战胜你。
         发布于 2015-04-07​赞同 1.2K​​收起评论​分享​收藏​感谢
         作者：刘鑫
         来源：知乎
         链接：https://www.zhihu.com/question/22937279/answer/44153363
         著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。
         </pre>
    </div>
</template>
<style scoped>
pre{
    font-size:18px;
}
</style>
<script>
export default {
}
</script>
